[
  {
    "id": "TICKET-001",
    "channel": "email",
    "customer_name": "Jennifer Martinez",
    "customer_email": "j.martinez@innovatedesign.com",
    "customer_phone": null,
    "subject": "Unable to reset my password - verification email not arriving",
    "category": "password_reset",
    "priority": "high",
    "message": "Dear TechCorp Support,\n\nI have been trying to reset my password for the past two hours, but I am not receiving the verification email. I have checked my spam and junk folders multiple times with no luck. I have also tried requesting the reset link three separate times.\n\nMy account email is j.martinez@innovatedesign.com. I need access urgently as we have a client deliverable due today and all our project files are in TechCorp.\n\nCould you please help me regain access to my account as soon as possible?\n\nBest regards,\nJennifer Martinez\nProject Manager, Innovate Design Co.",
    "expected_action": "resolve",
    "expected_response_summary": "Guide through password reset troubleshooting: check spam filters, whitelist notifications@techcorp.io, try incognito browser, and if still failing, initiate manual password reset through admin."
  },
  {
    "id": "TICKET-002",
    "channel": "email",
    "customer_name": "Robert Chen",
    "customer_email": "robert.chen@blueskytech.io",
    "customer_phone": null,
    "subject": "Question about upgrading from Starter to Professional plan",
    "category": "billing",
    "priority": "medium",
    "message": "Hello TechCorp Team,\n\nWe are currently on the Starter plan and our team has grown from 8 to 15 members. We are hitting the 10-member limit and need to understand our options.\n\nSpecifically, I would like to know:\n1. Is the upgrade prorated or do we pay the full amount immediately?\n2. Will we lose any data or settings during the upgrade?\n3. Can we do a trial of the Professional plan before committing?\n4. Are there any annual discounts available?\n\nWe are also interested in the GitHub integration that comes with Professional. Could you share more details about how it works?\n\nThank you for your time.\n\nRobert Chen\nCTO, BlueSky Technologies",
    "expected_action": "escalate",
    "expected_response_summary": "Provide billing details for Starter to Professional upgrade (prorated, no data loss, 14-day trial available, 20% annual discount). For detailed pricing consultation, escalate to sales team."
  },
  {
    "id": "TICKET-003",
    "channel": "email",
    "customer_name": "Sarah Kim",
    "customer_email": "sarah.k@creativeagency.co",
    "customer_phone": null,
    "subject": "Slack integration stopped sending notifications",
    "category": "integration",
    "priority": "high",
    "message": "Hi Support,\n\nOur Slack integration was working perfectly until yesterday. Now, none of our team members are receiving TechCorp notifications in Slack. We rely heavily on these notifications for task assignments and deadline reminders.\n\nWe've already tried:\n- Checking that the TechCorp bot is still in our Slack channels\n- Verifying our notification settings in TechCorp haven't changed\n- Asking our Slack admin if anything was changed on their end (nothing was)\n\nThis is affecting our entire team of 25 people and slowing down our workflow significantly.\n\nPlease advise on next steps.\n\nThanks,\nSarah Kim\nOperations Director",
    "expected_action": "resolve",
    "expected_response_summary": "Suggest re-authorizing the Slack integration in Settings > Integrations > Slack. The OAuth token may have expired. Disconnect and reconnect the integration, then verify notification preferences. Check techcorp status page for any known Slack integration issues."
  },
  {
    "id": "TICKET-004",
    "channel": "email",
    "customer_name": "David Thompson",
    "customer_email": "d.thompson@legalsolutions.com",
    "customer_phone": null,
    "subject": "Data residency requirements - EU compliance question",
    "category": "feature_question",
    "priority": "medium",
    "message": "Dear TechCorp Support,\n\nOur legal department requires confirmation regarding data residency for GDPR compliance purposes. We are a UK-based firm evaluating TechCorp for our operations.\n\nSpecifically, we need to understand:\n1. Where exactly is our data stored (specific AWS regions)?\n2. Do you offer EU data residency options?\n3. Can you provide your Data Processing Agreement (DPA)?\n4. Are you SOC 2 Type II certified?\n5. Is there a security whitepaper we can review?\n\nWe have strict data governance policies mandated by our legal counsel and need formal documentation before we can proceed with adoption.\n\nRegards,\nDavid Thompson\nIT Director, Legal Solutions Ltd.",
    "expected_action": "escalate",
    "expected_response_summary": "Provide basic answers (AWS US-East/EU-West, GDPR compliant, SOC 2 Type II certified, DPA available). Escalate to security team for formal documentation and whitepaper access under NDA."
  },
  {
    "id": "TICKET-005",
    "channel": "email",
    "customer_name": "Amanda Foster",
    "customer_email": "afoster@brightmedia.com",
    "customer_phone": null,
    "subject": "ERR-006 when connecting GitHub integration",
    "category": "bug_report",
    "priority": "medium",
    "message": "Hi there,\n\nI'm getting error code ERR-006 every time I try to connect our GitHub organization to TechCorp. I've tried the following:\n\n1. Disconnecting and reconnecting the integration\n2. Clearing browser cache and cookies\n3. Trying in a different browser (Chrome and Firefox)\n4. Verifying I have admin access on both GitHub and TechCorp\n\nThe error appears right after I authorize TechCorp in GitHub's OAuth flow. The screen briefly shows a loading spinner and then displays:\n\"ERR-006: Integration Connection Failed - Unable to establish connection with GitHub.\"\n\nWe just upgraded to Professional plan specifically for the GitHub integration, so this is quite frustrating.\n\nCan you help?\n\nAmanda Foster\nLead Developer, Bright Media",
    "expected_action": "resolve",
    "expected_response_summary": "ERR-006 indicates OAuth token or permissions issue. Walk through: 1) Revoke TechCorp access in GitHub Settings > Applications, 2) Reconnect from TechCorp Settings > Integrations > GitHub, 3) Ensure all required permissions are granted. If persists, check GitHub organization's third-party access policy."
  },
  {
    "id": "TICKET-006",
    "channel": "email",
    "customer_name": "Michael Rodriguez",
    "customer_email": "mrodriguez@nextstep.co",
    "customer_phone": null,
    "subject": "Request for refund - service not meeting expectations",
    "category": "billing",
    "priority": "high",
    "message": "To whom it may concern,\n\nWe subscribed to the Professional plan 3 weeks ago and have been extremely disappointed with the service. The platform is slow, the mobile app crashes frequently, and the Jira import failed to bring over our 2 years of project history correctly.\n\nWe have invested significant time trying to make TechCorp work for our team of 40 people, but at this point we want a full refund of our subscription fee.\n\nIf this cannot be resolved satisfactorily, we will be escalating this through our legal department and leaving negative reviews on G2 and Capterra.\n\nI expect a response within 24 hours.\n\nMichael Rodriguez\nVP of Operations, NextStep Inc.",
    "expected_action": "escalate",
    "expected_response_summary": "Acknowledge frustration, apologize for experience. Note 30-day refund policy applies (within window). Escalate to finance team for refund processing and to support lead for addressing technical issues (slow platform, mobile crashes, Jira import)."
  },
  {
    "id": "TICKET-007",
    "channel": "email",
    "customer_name": "Lisa Wang",
    "customer_email": "lwang@greenfield.org",
    "customer_phone": null,
    "subject": "How to set up automated weekly reports via email?",
    "category": "feature_question",
    "priority": "low",
    "message": "Hello,\n\nI'm trying to set up automated weekly project reports that get emailed to our management team every Monday morning. I know this feature exists on the Professional plan (which we have), but I cannot find where to configure it.\n\nCould you provide step-by-step instructions on how to:\n1. Create a custom report template\n2. Schedule it to send weekly\n3. Add multiple email recipients (including people who are not TechCorp users)\n\nThanks in advance!\n\nLisa Wang\nProject Coordinator, Greenfield Foundation",
    "expected_action": "resolve",
    "expected_response_summary": "Guide through: Reporting > Dashboards > create/select dashboard > click 'Schedule' icon > set frequency to Weekly, day to Monday, time to desired morning slot > add recipients by email (external emails supported) > save. Mention the report is sent as PDF attachment."
  },
  {
    "id": "TICKET-008",
    "channel": "email",
    "customer_name": "James Patterson",
    "customer_email": "jpatterson@alphaventures.com",
    "customer_phone": null,
    "subject": "API rate limit exceeded - need higher limits for our automation",
    "category": "api_help",
    "priority": "medium",
    "message": "Hello TechCorp Support,\n\nWe are building an internal automation tool that syncs data between TechCorp and our CRM system. We are on the Professional plan with 300 requests/minute and 50,000 requests/day limits.\n\nDuring our peak synchronization (which happens every 2 hours), we are hitting the rate limit (ERR-004). We estimate we need approximately 500 requests/minute during these sync windows.\n\nQuestions:\n1. Is there a way to temporarily increase our rate limit during sync windows?\n2. What are the Enterprise plan API limits?\n3. Is there a bulk API endpoint that would reduce the number of requests needed?\n4. Can we get a dedicated API endpoint for high-volume operations?\n\nPlease advise on the best path forward.\n\nJames Patterson\nSenior Developer, Alpha Ventures",
    "expected_action": "escalate",
    "expected_response_summary": "Explain Enterprise plan has 1000 req/min and unlimited daily. Suggest pagination and bulk endpoints. For temporary limit increases or custom API arrangements, escalate to sales team for Enterprise discussion."
  },
  {
    "id": "TICKET-009",
    "channel": "email",
    "customer_name": "Emily Richardson",
    "customer_email": "erichardson@suncoast.edu",
    "customer_phone": null,
    "subject": "Educational discount inquiry for university department",
    "category": "billing",
    "priority": "low",
    "message": "Dear TechCorp,\n\nI am the department head of Computer Science at Suncoast University. We are interested in using TechCorp Platform for managing research projects and student team collaborations across multiple courses.\n\nWe would need approximately 15 teams with varying sizes (10-30 members each). Before we proceed, I would like to know:\n\n1. Do you offer educational discounts?\n2. Is there a campus-wide licensing option?\n3. Can student accounts be provisioned in bulk via our university SSO (Azure AD)?\n4. What happens to student projects after they graduate?\n\nWe are evaluating TechCorp alongside two other platforms and a decision needs to be made by end of this month.\n\nBest,\nDr. Emily Richardson\nDepartment Head, Computer Science\nSuncoast University",
    "expected_action": "escalate",
    "expected_response_summary": "Confirm 50% educational discount exists. For campus-wide licensing, SSO setup, and bulk provisioning, escalate to sales team. Provide initial info about SSO being Enterprise-only feature."
  },
  {
    "id": "TICKET-010",
    "channel": "email",
    "customer_name": "Kevin O'Brien",
    "customer_email": "kobrien@swiftlogistics.com",
    "customer_phone": null,
    "subject": "Tasks disappearing from Kanban board randomly",
    "category": "bug_report",
    "priority": "urgent",
    "message": "URGENT - TechCorp Support,\n\nWe are experiencing a critical issue where tasks are disappearing from our Kanban board. This has happened to at least 12 tasks over the past 48 hours across 3 different projects.\n\nThe tasks are NOT in the trash or archived. When we search for them by name, they don't appear. When we try to access them via direct URL (which we copied before they disappeared), we get ERR-003.\n\nThis is severely impacting our operations - we are a logistics company and these tasks contain critical shipment tracking information.\n\nI need someone to investigate this IMMEDIATELY. We are on the Enterprise plan and expect this level of issue to be treated as P1.\n\nKevin O'Brien\nOperations Manager, Swift Logistics Inc.",
    "expected_action": "escalate",
    "expected_response_summary": "Acknowledge as P1 critical issue. Escalate immediately to engineering team. Ask customer for: project IDs affected, task IDs if available, approximate timestamps of disappearance, any team members who may have bulk-deleted. Assure SLA of <4 hours for P1 resolution."
  },
  {
    "id": "TICKET-011",
    "channel": "email",
    "customer_name": "Patricia Nguyen",
    "customer_email": "pnguyen@harmonyhealth.com",
    "customer_phone": null,
    "subject": "How to import projects from Jira to TechCorp",
    "category": "integration",
    "priority": "medium",
    "message": "Hi TechCorp Support,\n\nWe are migrating from Jira to TechCorp and need guidance on the import process. We have approximately 50 Jira projects with a total of around 15,000 issues.\n\nSpecific questions:\n1. How long will the import take for this volume?\n2. Will all comments and attachments be preserved?\n3. How are Jira custom fields handled?\n4. Can we map Jira workflows to TechCorp statuses before importing?\n5. Is there a way to do a test import before the full migration?\n\nWe want to minimize disruption to our team during the migration.\n\nThank you,\nPatricia Nguyen\nIT Manager, Harmony Health Systems",
    "expected_action": "resolve",
    "expected_response_summary": "Walk through the Jira import process: Settings > Integrations > Jira > Import from Jira. For 15K issues, expect 15-30 minutes. Comments and attachments (up to 25MB) are imported. Custom fields map to labels/description. Status and priority mapping available before import. Suggest importing one project first as a test."
  },
  {
    "id": "TICKET-012",
    "channel": "email",
    "customer_name": "Thomas Blackwell",
    "customer_email": "tblackwell@peakperformance.co",
    "customer_phone": null,
    "subject": "Feature request: Gantt chart dependencies visualization",
    "category": "feedback",
    "priority": "low",
    "message": "Hello,\n\nWe love using TechCorp for our project management needs. One feature we would really appreciate is a better visualization of task dependencies in the Timeline/Gantt view.\n\nCurrently, dependencies are shown as simple lines, but we would like to see:\n- Critical path highlighting\n- Dependency conflict warnings\n- Drag-to-create dependency arrows\n- Color coding for different dependency types (finish-to-start, start-to-start, etc.)\n\nThis would be incredibly useful for our construction project planning where dependencies are complex.\n\nKeep up the great work!\n\nThomas Blackwell\nProject Manager, Peak Performance Construction",
    "expected_action": "resolve",
    "expected_response_summary": "Thank for feedback and confirm it has been logged with the product team. Note that basic dependency visualization exists in Timeline view. Mention that enhanced Gantt features are on the product roadmap. Provide link to feature request board if available."
  },
  {
    "id": "TICKET-013",
    "channel": "email",
    "customer_name": "Rachel Adams",
    "customer_email": "radams@cosmicdesigns.com",
    "customer_phone": null,
    "subject": "Two-factor authentication setup not working with Authy",
    "category": "bug_report",
    "priority": "medium",
    "message": "Hi there,\n\nI'm trying to set up two-factor authentication on my account using Authy, but after scanning the QR code and entering the 6-digit code, I keep getting an error saying \"Invalid verification code.\"\n\nI have verified that:\n- My phone's time is set to automatic\n- I'm using the latest version of Authy\n- I'm entering the code within the 30-second window\n\nI tried Google Authenticator as well and got the same error. This is blocking me from meeting our company's security compliance deadline.\n\nPlease help!\n\nRachel Adams\nDesign Lead, Cosmic Designs",
    "expected_action": "resolve",
    "expected_response_summary": "Common issue with time sync. Guide: 1) In Authy settings, sync time correction. 2) In phone Settings > Date/Time, toggle automatic time off and on. 3) Clear TechCorp browser cache. 4) Try generating a new QR code (cancel and restart 2FA setup). 5) If persists, try SMS-based 2FA as alternative."
  },
  {
    "id": "TICKET-014",
    "channel": "email",
    "customer_name": "Mark Stevens",
    "customer_email": "mstevens@titaniumforge.com",
    "customer_phone": null,
    "subject": "Need to export all project data for audit purposes",
    "category": "feature_question",
    "priority": "medium",
    "message": "Dear Support Team,\n\nOur company is undergoing an internal audit and we need to export ALL project data from TechCorp, including:\n- All tasks with full history (status changes, assignee changes)\n- All comments\n- All attachments\n- Time tracking entries\n- Activity logs\n\nWe have 30 projects with approximately 5,000 tasks total. What is the best way to accomplish this? Can the API handle this volume? Is there a bulk export feature?\n\nWe need this data within the next week.\n\nThank you,\nMark Stevens\nCompliance Officer, Titanium Forge Industries",
    "expected_action": "resolve",
    "expected_response_summary": "Guide through export options: 1) Reporting > Exports for CSV/PDF per project. 2) For comprehensive export with history, use the REST API with pagination. 3) Enterprise customers can request a full data export from their account manager. Recommend API approach for structured data needs."
  },
  {
    "id": "TICKET-015",
    "channel": "email",
    "customer_name": "Sandra Lee",
    "customer_email": "slee@brightfuture.org",
    "customer_phone": null,
    "subject": "Non-profit discount application",
    "category": "billing",
    "priority": "low",
    "message": "Hello TechCorp,\n\nBright Future Foundation is a registered 501(c)(3) non-profit organization focused on youth education. We are currently using the free trial and would like to continue with a paid plan.\n\nI understand you offer non-profit discounts. Could you please let me know:\n1. What documentation do you need to verify our non-profit status?\n2. What is the discount percentage?\n3. Does it apply to all plan tiers?\n4. How long does the verification process take?\n\nI have our IRS determination letter and state registration documents ready to submit.\n\nThank you for supporting non-profits!\n\nSandra Lee\nExecutive Director, Bright Future Foundation",
    "expected_action": "escalate",
    "expected_response_summary": "Confirm 50% non-profit discount on all plans. For verification and application, escalate to sales team (sales@techcorp.io). They will need the IRS determination letter. Process typically takes 2-3 business days."
  },
  {
    "id": "TICKET-016",
    "channel": "email",
    "customer_name": "Andrew Mitchell",
    "customer_email": "amitchell@quantumsoftware.io",
    "customer_phone": null,
    "subject": "Webhook signature verification failing",
    "category": "api_help",
    "priority": "medium",
    "message": "Hello,\n\nWe are implementing webhook consumption in our application and having trouble verifying the HMAC-SHA256 signatures. We are using Node.js and the crypto module.\n\nOur verification code:\n```\nconst crypto = require('crypto');\nconst signature = req.headers['x-techcorp-signature'];\nconst hash = crypto.createHmac('sha256', webhookSecret).update(req.body).digest('hex');\nif (signature !== hash) { // always fails }\n```\n\nThe signature never matches. We have double-checked our webhook secret. Are we using the correct header name? Is the request body raw or parsed?\n\nDocumentation on webhook verification seems sparse.\n\nAndrew Mitchell\nBackend Developer, Quantum Software",
    "expected_action": "resolve",
    "expected_response_summary": "The header is 'x-techcorp-signature' (correct). The issue is likely that req.body needs to be the raw request body string, not parsed JSON. In Express.js, use express.raw() middleware for the webhook route. Also ensure the secret has no trailing whitespace. Provide corrected code example."
  },
  {
    "id": "TICKET-017",
    "channel": "email",
    "customer_name": "Catherine Brooks",
    "customer_email": "cbrooks@meridianpartners.com",
    "customer_phone": null,
    "subject": "I want to speak to your manager - this is unacceptable",
    "category": "feedback",
    "priority": "urgent",
    "message": "This is the THIRD time I am reaching out about the same issue and nobody has resolved it. Your platform has been down for our team TWICE this week and we have lost billable hours because of it.\n\nI am absolutely furious. We pay $79/month for a service that doesn't work. This is UNACCEPTABLE and I demand to speak with a manager immediately.\n\nIf I don't hear back from an actual human being within the hour, we are cancelling our subscription and I will make sure every single person in my network knows about this terrible experience.\n\nI also want documentation of every outage for our records as we are considering legal action for breach of SLA.\n\nCatherine Brooks\nManaging Partner, Meridian Partners LLC",
    "expected_action": "escalate",
    "expected_response_summary": "Immediate escalation to support lead due to: angry customer, legal language mention, repeat contact, manager request. Acknowledge frustration, apologize sincerely, provide status page link for outage documentation. Route to Priya Patel (Head of Support) for personal follow-up."
  },
  {
    "id": "TICKET-018",
    "channel": "email",
    "customer_name": "Daniel Park",
    "customer_email": "dpark@velocitytech.com",
    "customer_phone": null,
    "subject": "Zapier integration - trigger for subtask completion not firing",
    "category": "integration",
    "priority": "medium",
    "message": "Hi Support,\n\nWe have a Zapier automation set up to fire when a task is completed in TechCorp. It works fine for regular tasks, but it does not trigger when a subtask is completed.\n\nIs subtask completion not supported as a Zapier trigger? If not, is there a workaround? We use subtasks extensively and need this automation for our workflow.\n\nThe Zap has been on and running fine for parent tasks for 3 months now.\n\nDaniel Park\nAutomation Engineer, Velocity Tech",
    "expected_action": "resolve",
    "expected_response_summary": "Currently, the Task Completed trigger in Zapier fires for parent tasks only. Subtask completions are not included. Workaround options: 1) Use the TechCorp API webhooks directly (task.updated event includes subtask changes). 2) Restructure subtasks as regular tasks with dependencies. Log as feature request for Zapier subtask triggers."
  },
  {
    "id": "TICKET-019",
    "channel": "email",
    "customer_name": "Nicole Harper",
    "customer_email": "nharper@globalreach.co",
    "customer_phone": null,
    "subject": "Mobile app crashes on Android when opening task details",
    "category": "bug_report",
    "priority": "high",
    "message": "Dear Support,\n\nThe TechCorp Android app consistently crashes when I try to open any task that has more than 5 attachments. This started happening after the latest app update (version 4.2.1).\n\nDevice details:\n- Samsung Galaxy S23 Ultra\n- Android 14\n- TechCorp app version 4.2.1\n- Plenty of storage space available (128 GB free)\n\nI have tried:\n- Clearing app cache\n- Reinstalling the app\n- Restarting my phone\n\nThe crash happens every time, and it is reproducible on my colleague's Pixel 8 as well.\n\nPlease fix this urgently as several of our team members are field workers who rely exclusively on the mobile app.\n\nNicole Harper\nField Operations Manager, Global Reach Corp",
    "expected_action": "escalate",
    "expected_response_summary": "Acknowledged as reproducible bug in Android app v4.2.1 with 5+ attachments. Escalate to engineering team with reproduction steps and device details. Suggest temporary workaround: access tasks via mobile browser instead of app until fix is released."
  },
  {
    "id": "TICKET-020",
    "channel": "email",
    "customer_name": "William Torres",
    "customer_email": "wtorres@pinnaclegroup.com",
    "customer_phone": null,
    "subject": "Enterprise plan inquiry - need SSO and custom SLA",
    "category": "billing",
    "priority": "medium",
    "message": "Hello TechCorp Team,\n\nPinnacle Group is evaluating TechCorp Platform for our organization of 350 employees across 6 offices. We are currently using a competitor and are looking to switch.\n\nOur requirements:\n1. SAML SSO integration with Okta\n2. Custom SLA with 99.95% uptime guarantee\n3. Dedicated account manager\n4. Data residency in EU (we are headquartered in Germany)\n5. Audit log retention of 2+ years\n6. Custom onboarding and training for our teams\n7. Volume pricing for 350+ users\n\nCould we schedule a demo and discuss Enterprise pricing?\n\nRegards,\nWilliam Torres\nHead of IT, Pinnacle Group GmbH",
    "expected_action": "escalate",
    "expected_response_summary": "Confirm Enterprise plan supports all listed requirements (SSO, custom SLA, dedicated AM, EU data residency, audit logs, custom onboarding). Escalate to sales team (Rachel Thompson) for demo scheduling and custom pricing discussion."
  },
  {
    "id": "TICKET-021",
    "channel": "whatsapp",
    "customer_name": "Mike Johnson",
    "customer_email": "mjohnson@quickstartup.com",
    "customer_phone": "+1-555-0101",
    "subject": "Password reset help",
    "category": "password_reset",
    "priority": "high",
    "message": "Hey I cant login to my account. Forgot my password and the reset email isnt coming through. Can u help? My email is mjohnson@quickstartup.com",
    "expected_action": "resolve",
    "expected_response_summary": "Check spam/junk, whitelist notifications@techcorp.io, try requesting reset again. If still not working, can initiate manual reset with account verification."
  },
  {
    "id": "TICKET-022",
    "channel": "whatsapp",
    "customer_name": "Priya Sharma",
    "customer_email": "priya@designhub.in",
    "customer_phone": "+91-98765-43210",
    "subject": "How to add team members",
    "category": "feature_question",
    "priority": "low",
    "message": "Hi! Just started using TechCorp. How do I add my team members? We have 5 people to add",
    "expected_action": "resolve",
    "expected_response_summary": "Go to Settings > Team Members > Invite Members. Enter emails, select roles, click Send Invitations. They'll get an email with join link."
  },
  {
    "id": "TICKET-023",
    "channel": "whatsapp",
    "customer_name": "Carlos Ruiz",
    "customer_email": "cruiz@fasttrack.mx",
    "customer_phone": "+52-555-123-4567",
    "subject": "Billing charged twice",
    "category": "billing",
    "priority": "urgent",
    "message": "Hey I just checked my credit card and TechCorp charged me TWICE this month!! $79 x2!! I need this fixed NOW and I want a refund for the extra charge",
    "expected_action": "escalate",
    "expected_response_summary": "Apologize for billing error. Cannot process refunds directly - escalate to finance team (billing@techcorp.io) immediately with customer details for duplicate charge investigation and refund."
  },
  {
    "id": "TICKET-024",
    "channel": "whatsapp",
    "customer_name": "Emma Wilson",
    "customer_email": "emma.w@cloudnine.co.uk",
    "customer_phone": "+44-7700-900123",
    "subject": "Kanban not loading",
    "category": "bug_report",
    "priority": "high",
    "message": "Our kanban board has been stuck on loading for 20 mins. All other pages work fine. Just the kanban view is broken. We have about 200 tasks on it",
    "expected_action": "resolve",
    "expected_response_summary": "200 tasks on Kanban may cause slow loading. Try: 1) Hard refresh (Ctrl+Shift+R), 2) Switch to List view then back, 3) Apply filters to reduce visible tasks, 4) Clear browser cache. If persists, try different browser."
  },
  {
    "id": "TICKET-025",
    "channel": "whatsapp",
    "customer_name": "Jake Morrison",
    "customer_email": "jake@buildright.com",
    "customer_phone": "+1-555-0202",
    "subject": "Can I get a human agent please",
    "category": "feature_question",
    "priority": "medium",
    "message": "I need to talk to a real person. Can you connect me to a human agent? This is too complicated to explain over text",
    "expected_action": "escalate",
    "expected_response_summary": "Customer explicitly requesting human agent - immediate escalation. Confirm human support available Mon-Fri 9am-6pm EST. If within hours, transfer to human agent. If outside hours, collect details and schedule callback."
  },
  {
    "id": "TICKET-026",
    "channel": "whatsapp",
    "customer_name": "Aisha Patel",
    "customer_email": "aisha@crescenttech.ae",
    "customer_phone": "+971-50-123-4567",
    "subject": "Time tracking not showing",
    "category": "feature_question",
    "priority": "low",
    "message": "Where is the time tracking feature? I cant find it anywhere in my dashboard. We're on Starter plan",
    "expected_action": "resolve",
    "expected_response_summary": "Time tracking is available on Professional and Enterprise plans only. Starter plan does not include time tracking. Suggest upgrading to Professional ($79/mo) for time tracking plus other features."
  },
  {
    "id": "TICKET-027",
    "channel": "whatsapp",
    "customer_name": "Tom Baker",
    "customer_email": "tbaker@redline.io",
    "customer_phone": "+1-555-0303",
    "subject": "This app is absolute garbage",
    "category": "feedback",
    "priority": "high",
    "message": "Your f***ing app just lost all my data. 3 hours of work GONE. This is the worst project management tool Ive ever used. I want my money back NOW or Im going to blast you on social media",
    "expected_action": "escalate",
    "expected_response_summary": "Escalate immediately - profanity detected, angry customer, refund demand. Acknowledge frustration, apologize sincerely. Ask for specifics about data loss (which project, what tasks). Escalate to support lead for personal attention and finance for refund consideration."
  },
  {
    "id": "TICKET-028",
    "channel": "whatsapp",
    "customer_name": "Yuki Tanaka",
    "customer_email": "ytanaka@sakurasoft.jp",
    "customer_phone": "+81-90-1234-5678",
    "subject": "Calendar view showing wrong dates",
    "category": "bug_report",
    "priority": "medium",
    "message": "Hi, my calendar view is showing all tasks one day off. I think its a timezone issue? Im in Tokyo (JST/UTC+9) but tasks appear one day earlier than they should",
    "expected_action": "resolve",
    "expected_response_summary": "Likely timezone setting issue. Check Profile Settings > Timezone and ensure it's set to Asia/Tokyo (UTC+9). If already correct, try: clear browser cache, log out and back in. The calendar uses the profile timezone for display."
  },
  {
    "id": "TICKET-029",
    "channel": "whatsapp",
    "customer_name": "Laura Costa",
    "customer_email": "lcosta@visionlabs.br",
    "customer_phone": "+55-11-91234-5678",
    "subject": "API key not working",
    "category": "api_help",
    "priority": "medium",
    "message": "My API key keeps returning 401 errors. I just generated it today. Using it in the Authorization header as Bearer token. Whats wrong?",
    "expected_action": "resolve",
    "expected_response_summary": "Verify: 1) Key format is correct (tk_live_...), 2) Header is exactly 'Authorization: Bearer tk_live_abc123' with no extra spaces, 3) Key has the right permissions scope, 4) Key hasn't been revoked. Try generating a new key. Also check if on Starter plan - API access may be limited."
  },
  {
    "id": "TICKET-030",
    "channel": "whatsapp",
    "customer_name": "Raj Mehta",
    "customer_email": "raj@cloudstack.in",
    "customer_phone": "+91-99876-54321",
    "subject": "How to archive old projects",
    "category": "feature_question",
    "priority": "low",
    "message": "We have about 20 old projects cluttering our sidebar. How do we archive them?",
    "expected_action": "resolve",
    "expected_response_summary": "Open project > Settings (gear icon) > Archive Project > Confirm. Archived projects move to Settings > Archived Projects. They're read-only but searchable. Can be restored anytime."
  },
  {
    "id": "TICKET-031",
    "channel": "whatsapp",
    "customer_name": "Sofia Andersen",
    "customer_email": "sofia@nordicflow.no",
    "customer_phone": "+47-412-34-567",
    "subject": "Representative please",
    "category": "feature_question",
    "priority": "medium",
    "message": "Hi can I speak to a representative? I have some questions about your enterprise plan that the bot probably cant answer",
    "expected_action": "escalate",
    "expected_response_summary": "Customer requesting representative - escalate. Collect initial questions if possible, then route to sales team for Enterprise discussion. Confirm human support hours."
  },
  {
    "id": "TICKET-032",
    "channel": "whatsapp",
    "customer_name": "Chris Taylor",
    "customer_email": "chris@agileops.com",
    "customer_phone": "+1-555-0404",
    "subject": "Notification overload",
    "category": "feature_question",
    "priority": "low",
    "message": "Im getting way too many email notifications from TechCorp. Like 50 a day. How do I turn most of them off but keep the important ones?",
    "expected_action": "resolve",
    "expected_response_summary": "Go to Profile Settings > Notifications. Set to 'Assigned to me / Mentioned' instead of 'All activity'. Can also set Quiet Hours and mute specific projects. Use project-level notification settings to unwatch less important projects."
  },
  {
    "id": "TICKET-033",
    "channel": "whatsapp",
    "customer_name": "Diana Flores",
    "customer_email": "diana@sparkstudio.mx",
    "customer_phone": "+52-555-987-6543",
    "subject": "File upload failing",
    "category": "bug_report",
    "priority": "medium",
    "message": "I keep getting ERR-005 when trying to upload a design file. Its a 30MB PSD file. Is there a size limit?",
    "expected_action": "resolve",
    "expected_response_summary": "Yes, max file size is 25 MB per file. The 30MB PSD exceeds this limit. Suggestions: compress the file, export as smaller format (PNG/JPG for previews), use a file sharing service and link to it in the task description, or split into smaller files."
  },
  {
    "id": "TICKET-034",
    "channel": "whatsapp",
    "customer_name": "Ben Lewis",
    "customer_email": "ben@startupgrind.com",
    "customer_phone": "+1-555-0505",
    "subject": "Task dependencies question",
    "category": "feature_question",
    "priority": "low",
    "message": "Can I set task dependencies so Task B cant start until Task A is done? How?",
    "expected_action": "resolve",
    "expected_response_summary": "Yes! Open Task B > click Dependencies section > Add Dependency > search for Task A > select 'Blocked by'. Task B will show as Blocked until Task A is marked Done. Dependencies also show as connecting lines in Timeline/Gantt view."
  },
  {
    "id": "TICKET-035",
    "channel": "whatsapp",
    "customer_name": "Hannah Schmidt",
    "customer_email": "hannah@berlindigital.de",
    "customer_phone": "+49-170-1234567",
    "subject": "Account locked out",
    "category": "password_reset",
    "priority": "high",
    "message": "Help! My account is locked. I think I typed my password wrong too many times. How long until its unlocked?",
    "expected_action": "resolve",
    "expected_response_summary": "Accounts auto-unlock after 15 minutes following 5 failed login attempts. Wait 15 min and try again. If you've forgotten your password, use Forgot Password after the lockout expires. Make sure Caps Lock is off."
  },
  {
    "id": "TICKET-036",
    "channel": "web_form",
    "customer_name": "Alexandra Petrov",
    "customer_email": "apetrov@silverlinetech.com",
    "customer_phone": null,
    "subject": "Cannot change team member role from Member to Admin",
    "category": "feature_question",
    "priority": "medium",
    "message": "I am trying to promote one of our team members from Member role to Admin role, but the role dropdown is greyed out. I am logged in as a Manager. Is this a permissions issue? What role do I need to have to change member roles?\n\nTeam: Silverline Development\nMember to promote: alex.murphy@silverlinetech.com\nCurrent role: Member\nDesired role: Admin",
    "expected_action": "resolve",
    "expected_response_summary": "Only Admin role can promote members to Admin. Managers can change roles between Manager, Member, and Viewer but cannot assign Admin role. Contact your team Admin to make this change, or have the current Admin promote you to Admin first."
  },
  {
    "id": "TICKET-037",
    "channel": "web_form",
    "customer_name": "Marcus Green",
    "customer_email": "mgreen@urbanplanning.gov",
    "customer_phone": null,
    "subject": "Government procurement - security questionnaire",
    "category": "feature_question",
    "priority": "medium",
    "message": "We are a government agency evaluating TechCorp for our project management needs. As part of our procurement process, we need TechCorp to complete a security questionnaire (attached). We also need:\n\n1. SOC 2 Type II audit report\n2. Penetration test results summary\n3. Data flow diagram\n4. Business continuity and disaster recovery plan documentation\n5. Confirmation of FedRAMP compliance status\n\nPlease route this to your security and compliance team.",
    "expected_action": "escalate",
    "expected_response_summary": "Acknowledge procurement request. TechCorp is SOC 2 Type II certified. Escalate to security team (security@techcorp.io) for: security questionnaire completion, audit report (under NDA), pen test summary, data flow diagram, BC/DR documentation. Note FedRAMP status for government team."
  },
  {
    "id": "TICKET-038",
    "channel": "web_form",
    "customer_name": "Jessica Wright",
    "customer_email": "jwright@blossomevents.com",
    "customer_phone": null,
    "subject": "Onboarding wizard stuck on Step 3",
    "category": "bug_report",
    "priority": "medium",
    "message": "I just signed up for TechCorp and the onboarding wizard is stuck on Step 3 (Choose a Template). When I click on any template, nothing happens. The page doesn't freeze - the buttons just don't respond.\n\nBrowser: Chrome 120 on MacOS Sonoma\nAccount created: today\nEmail: jwright@blossomevents.com\n\nI tried refreshing and clearing cache. Same issue in incognito mode.",
    "expected_action": "resolve",
    "expected_response_summary": "Known issue with some browser extensions blocking template selection. Try: 1) Disable all browser extensions (especially ad blockers), 2) Try Safari or Firefox, 3) If still stuck, skip the wizard (click Skip in top-right) and create a project manually from the dashboard. Report to engineering if persists."
  },
  {
    "id": "TICKET-039",
    "channel": "web_form",
    "customer_name": "Ryan Cooper",
    "customer_email": "rcooper@dataflow.io",
    "customer_phone": null,
    "subject": "Webhook events not being received",
    "category": "api_help",
    "priority": "high",
    "message": "We set up a webhook to receive task.created and task.updated events, but our endpoint is not receiving any payloads. Details:\n\n- Webhook URL: https://api.dataflow.io/webhooks/techcorp\n- Events subscribed: task.created, task.updated\n- Our endpoint returns 200 OK (verified with manual POST requests)\n- Created webhook 2 hours ago\n- Created several tasks since then - nothing received\n- Checked webhook logs in TechCorp - shows \"pending\" for all deliveries\n\nIs there a delay? Are webhooks working correctly right now?",
    "expected_action": "resolve",
    "expected_response_summary": "Check: 1) Webhook logs for delivery status and any error messages, 2) Ensure endpoint is publicly accessible (not behind VPN/firewall), 3) Verify SSL certificate is valid (TechCorp requires HTTPS), 4) Check if endpoint is responding within 10-second timeout. Test with a simple endpoint like webhook.site first to confirm TechCorp is sending events."
  },
  {
    "id": "TICKET-040",
    "channel": "web_form",
    "customer_name": "Michelle Torres",
    "customer_email": "mtorres@brightpath.edu",
    "customer_phone": null,
    "subject": "Student accounts - bulk creation and SSO",
    "category": "feature_question",
    "priority": "medium",
    "message": "I am an IT administrator at Bright Path Academy. We want to use TechCorp for 200 student project teams. Questions:\n\n1. Can we create student accounts in bulk via CSV upload?\n2. Can we connect TechCorp to our Google Workspace SSO?\n3. Can students be automatically added to specific projects based on their class?\n4. What happens when a student leaves - can we bulk deactivate accounts?\n5. Is there an education pricing tier?\n\nWe need this set up before the start of the fall semester.",
    "expected_action": "escalate",
    "expected_response_summary": "Bulk invites via email (comma-separated) available. SSO/SAML is Enterprise-only feature. For educational pricing (50% off), bulk provisioning, and automated student management, escalate to sales team. Google Workspace SSO is supported on Enterprise."
  },
  {
    "id": "TICKET-041",
    "channel": "web_form",
    "customer_name": "Patrick O'Donnell",
    "customer_email": "podonnell@celticmedia.ie",
    "customer_phone": null,
    "subject": "Cannot delete completed projects - getting error",
    "category": "bug_report",
    "priority": "low",
    "message": "I'm trying to delete some old completed projects but getting an error when I click delete. I've already archived them first (as the docs say). When I go to Settings > Archived Projects and click Permanently Delete, I get a generic error message with no error code.\n\nI'm an Admin on our team. Tried on Chrome and Edge. Same result.\n\nProjects I'm trying to delete:\n- Q1 2024 Campaign (archived 3 months ago)\n- Old Client Onboarding (archived 6 months ago)\n- Test Project (archived 1 week ago)",
    "expected_action": "resolve",
    "expected_response_summary": "When deleting, you must type the exact project name to confirm. Ensure: 1) Project name typed exactly matches (case-sensitive), 2) No trailing spaces, 3) Browser pop-up blocker isn't blocking the confirmation dialog. If error persists, try: clear cache, log out/in, or try from a different browser. If still failing, may be a bug - collect browser console errors."
  },
  {
    "id": "TICKET-042",
    "channel": "web_form",
    "customer_name": "Samantha Reed",
    "customer_email": "sreed@horizonconsulting.com",
    "customer_phone": null,
    "subject": "Request to download all invoices for tax filing",
    "category": "billing",
    "priority": "medium",
    "message": "Hi, I need to download all of our TechCorp invoices from 2024 for our tax filing. Is there a way to bulk download all invoices for a specific year? Currently I can only download them one at a time from Settings > Billing > Invoices.\n\nWe have 12 monthly invoices to download. A bulk option would save a lot of time.\n\nAccount: Horizon Consulting Group\nPlan: Professional\nBilling contact: sreed@horizonconsulting.com",
    "expected_action": "resolve",
    "expected_response_summary": "Currently invoices must be downloaded individually from Settings > Billing > Invoices. For bulk download, contact billing@techcorp.io and they can send a consolidated invoice package for the tax year. Each invoice is available as PDF with all required tax details."
  },
  {
    "id": "TICKET-043",
    "channel": "web_form",
    "customer_name": "Victor Huang",
    "customer_email": "vhuang@apexdevelopment.com",
    "customer_phone": null,
    "subject": "GitHub integration - auto-close not working on PR merge",
    "category": "integration",
    "priority": "medium",
    "message": "We have the GitHub integration set up and PR linking works great. However, the auto-close feature (task moves to Done when PR is merged) is not working.\n\nOur setup:\n- GitHub org: apex-dev\n- Repo: apex-dev/main-platform mapped to TechCorp project \"Platform Development\"\n- Auto-close setting: Enabled in project integration settings\n- PR title format: \"TASK-123: Description\"\n\nWhen we merge PRs with task references, the tasks stay in \"In Review\" status. We have to manually change them to Done.\n\nWe've merged about 15 PRs this week and none triggered the auto-close.",
    "expected_action": "resolve",
    "expected_response_summary": "Auto-close requires the task reference in a specific format. Check: 1) Task ID must be in PR title or description (not just branch name), 2) Format must be exact: TASK-XXX (with hyphen, all caps), 3) Verify auto-close is enabled per-project in Project Settings > Integrations > GitHub, 4) The merging user must have a linked TechCorp account. Try disconnecting and reconnecting the repo mapping."
  },
  {
    "id": "TICKET-044",
    "channel": "web_form",
    "customer_name": "Natalie Fisher",
    "customer_email": "nfisher@dreamscapearchitects.com",
    "customer_phone": null,
    "subject": "How to use task templates for recurring projects",
    "category": "feature_question",
    "priority": "low",
    "message": "We run similar projects repeatedly for different clients (architectural design projects). Each project has the same phases and task structure but different details.\n\nIs there a way to:\n1. Create a task template with predefined tasks, subtasks, and dependencies?\n2. Duplicate an entire project as a starting point for a new client?\n3. Set up recurring tasks that auto-create on a schedule?\n\nThis would save us hours of setup time each month.",
    "expected_action": "resolve",
    "expected_response_summary": "Yes to all three: 1) Create a project template: set up a project with all tasks/subtasks/dependencies > Project Settings > Save as Template. 2) Duplicate project: right-click project in sidebar > Duplicate Project (copies all tasks, subtasks, dependencies without assignees/dates). 3) Recurring tasks: not natively supported yet, but use Zapier to auto-create tasks on a schedule. Also can use the REST API for automation."
  },
  {
    "id": "TICKET-045",
    "channel": "web_form",
    "customer_name": "Gregory Dawson",
    "customer_email": "gdawson@steelbridge.co",
    "customer_phone": null,
    "subject": "ERR-008 - Cannot access our workspace",
    "category": "billing",
    "priority": "urgent",
    "message": "URGENT: Our entire team of 30 people cannot access TechCorp. We are all getting ERR-008: Subscription Expired.\n\nThis makes no sense - our billing is set to auto-renew and we have not cancelled anything. Our credit card on file is valid and has not expired.\n\nWe need immediate access restored. We have active client projects with deadlines this week.\n\nAccount: Steel Bridge Construction\nPlan: Professional (annual billing)\nBilling email: accounting@steelbridge.co\nLast successful charge: December 15, 2025",
    "expected_action": "escalate",
    "expected_response_summary": "ERR-008 urgent - entire team locked out. Escalate immediately to finance team (billing@techcorp.io) for investigation. Likely payment processing failure. Ask customer to verify: 1) Card not declined/replaced, 2) No fraud alerts on card, 3) Check billing@steelbridge.co for payment failure notices. Assure data is safe and preserved."
  },
  {
    "id": "TICKET-046",
    "channel": "web_form",
    "customer_name": "Olivia Barnes",
    "customer_email": "obarnes@puredesign.co",
    "customer_phone": null,
    "subject": "Feature request: Dark mode",
    "category": "feedback",
    "priority": "low",
    "message": "Hey TechCorp team! Just wanted to put in a request for dark mode. I spend 8+ hours a day in TechCorp and the bright white UI is tough on the eyes, especially in the evening.\n\nI know this is probably on your roadmap already, but wanted to add another vote. Would love to see it with proper contrast ratios and not just an inverted color scheme.\n\nThanks for building a great product!",
    "expected_action": "resolve",
    "expected_response_summary": "Thank for the feedback and kind words. Dark mode is on the product roadmap. Log the feature vote. In the meantime, suggest browser-based dark mode extensions like Dark Reader as a temporary workaround. Provide link to feature request board for upvoting."
  },
  {
    "id": "TICKET-047",
    "channel": "web_form",
    "customer_name": "Ian McCallister",
    "customer_email": "imccallister@northstarlogistics.com",
    "customer_phone": null,
    "subject": "Data breach concern - unauthorized access to our workspace",
    "category": "bug_report",
    "priority": "urgent",
    "message": "SECURITY ALERT: We have noticed suspicious activity in our TechCorp workspace. Tasks are being created and modified by an account we don't recognize (john.temp@gmail.com). This account appears to have Member-level access.\n\nNo one on our team invited this person. We are extremely concerned about unauthorized access to our project data, which includes sensitive client information.\n\nWe need:\n1. This account immediately suspended\n2. An audit log of all actions taken by this account\n3. An investigation into how this account gained access\n4. Confirmation that our data has not been exfiltrated\n\nThis is a potential data breach and we expect it to be treated with the highest urgency.\n\nIan McCallister\nIT Security Director, NorthStar Logistics",
    "expected_action": "escalate",
    "expected_response_summary": "CRITICAL SECURITY - Escalate immediately to security team (security@techcorp.io). Advise customer to: 1) Remove the unauthorized account immediately from Settings > Team Members, 2) Have all team members change passwords, 3) Enable 2FA for all accounts, 4) Check invitation history in Settings > Activity Log. Security team will investigate access audit trail."
  },
  {
    "id": "TICKET-048",
    "channel": "web_form",
    "customer_name": "Rebecca Liu",
    "customer_email": "rliu@oceanview.com",
    "customer_phone": null,
    "subject": "Bulk import tasks from CSV",
    "category": "feature_question",
    "priority": "low",
    "message": "We're migrating from spreadsheets and have about 500 tasks in a CSV file. Is there a way to bulk import tasks from CSV into a TechCorp project?\n\nOur CSV has columns: Task Name, Description, Assignee Email, Due Date, Priority, Labels\n\nIf there's no built-in import, can the API handle this volume?",
    "expected_action": "resolve",
    "expected_response_summary": "No built-in CSV import currently. Two options: 1) Use the REST API to create tasks programmatically (POST /projects/:id/tasks). At 300 req/min on Professional plan, 500 tasks would take under 2 minutes. 2) Use Zapier with Google Sheets as source to create tasks. Provide API example for bulk creation."
  },
  {
    "id": "TICKET-049",
    "channel": "web_form",
    "customer_name": "Steven Walsh",
    "customer_email": "swalsh@momentum.io",
    "customer_phone": null,
    "subject": "Performance issues - pages taking 10+ seconds to load",
    "category": "bug_report",
    "priority": "high",
    "message": "For the past 3 days, TechCorp has been extremely slow for our entire team. Pages take 10-15 seconds to load, task updates have significant lag, and the real-time collaboration feature seems broken (changes don't appear for other users for minutes).\n\nWe checked:\n- Our internet is fine (100 Mbps, other services work normally)\n- Happening on multiple browsers and devices\n- Status page shows no incidents\n- We have about 50 active projects and 3,000 total tasks\n\nThis is significantly impacting our productivity. Is there an ongoing infrastructure issue?",
    "expected_action": "escalate",
    "expected_response_summary": "Widespread team impact suggests server-side issue rather than client-side. Escalate to engineering team for investigation. Collect: team workspace URL, approximate times of worst performance, any specific projects/views most affected. Check status.techcorp.io for unreported incidents."
  },
  {
    "id": "TICKET-050",
    "channel": "web_form",
    "customer_name": "Katherine Young",
    "customer_email": "kyoung@summitadvisors.com",
    "customer_phone": null,
    "subject": "Need help with Zapier automation for client onboarding",
    "category": "integration",
    "priority": "low",
    "message": "Hi! We want to set up a Zapier automation that does the following:\n\n1. When a new client is added to our CRM (HubSpot), automatically create a new TechCorp project using our 'Client Onboarding' template\n2. Create initial tasks in that project with the client's name in the task titles\n3. Assign tasks to specific team members based on the client's service tier\n\nIs this possible with the current Zapier integration? We couldn't figure out how to create a project from a template through Zapier.\n\nAny guidance would be appreciated!",
    "expected_action": "resolve",
    "expected_response_summary": "Partially possible with Zapier: Step 1 - Create Project action works (but template selection not supported via Zapier). Step 2 - Create Task action works, use Zapier formatter to insert client name. Step 3 - Conditional logic in Zapier can assign different members. For template-based project creation, use the REST API instead. Suggest hybrid: API call for project creation with template, then Zapier for subsequent automations."
  },
  {
    "id": "TICKET-051",
    "channel": "email",
    "customer_name": "George Hernandez",
    "customer_email": "ghernandez@solarisventures.com",
    "customer_phone": null,
    "subject": "Legal notice - data retention after account cancellation",
    "category": "feedback",
    "priority": "urgent",
    "message": "Dear TechCorp Legal Department,\n\nWe cancelled our TechCorp subscription on January 15, 2026 and were told our data would be retained for 30 days. It is now February 20, 2026, and we need to access some critical project files that we failed to export before cancellation.\n\nUnder our interpretation of the applicable data retention regulations, we believe we have the right to access our data for a longer period. We are prepared to pursue this through legal channels if necessary.\n\nPlease confirm:\n1. Has our data been permanently deleted?\n2. If not, can our account be temporarily reactivated for data export?\n3. What is your formal data retention policy?\n\nOur legal team is standing by.\n\nGeorge Hernandez\nCFO, Solaris Ventures LLC",
    "expected_action": "escalate",
    "expected_response_summary": "Legal language detected - immediate escalation. Route to legal/compliance team. Data retention is 30 days per ToS. The 30-day window has passed. Do not make legal commitments. Acknowledge the request and confirm it will be reviewed by the appropriate team urgently."
  },
  {
    "id": "TICKET-052",
    "channel": "email",
    "customer_name": "Diane Crawford",
    "customer_email": "dcrawford@elevatemarketing.com",
    "customer_phone": null,
    "subject": "How to create custom task statuses for our workflow",
    "category": "feature_question",
    "priority": "low",
    "message": "Hello TechCorp Support,\n\nOur marketing team uses a unique workflow that doesn't fit the default task statuses (To Do, In Progress, In Review, Done). We need the following custom statuses:\n\n1. Ideation\n2. Brief Created\n3. In Design\n4. Client Review\n5. Revisions\n6. Approved\n7. Published\n8. Archived\n\nIs it possible to create custom statuses? If so, can we set the order they appear in the Kanban board?\n\nThank you,\nDiane Crawford\nMarketing Director, Elevate Marketing",
    "expected_action": "resolve",
    "expected_response_summary": "Yes, custom statuses are supported. Go to Project Settings > Statuses > Add Custom Status. You can add, rename, reorder, and color-code statuses. Drag to reorder Kanban columns. Map each status to a category (Not Started, In Progress, Completed) for reporting. Up to 15 custom statuses per project."
  },
  {
    "id": "TICKET-053",
    "channel": "whatsapp",
    "customer_name": "Alex Nguyen",
    "customer_email": "alexn@rapidgrowth.co",
    "customer_phone": "+1-555-0606",
    "subject": "Forgot email used for signup",
    "category": "password_reset",
    "priority": "medium",
    "message": "Hey I forgot which email I used to sign up for TechCorp. I know my team name is rapid-growth. Can you help me figure out my account email?",
    "expected_action": "escalate",
    "expected_response_summary": "Cannot look up account emails for security reasons. Ask if any team member can check Settings > Team Members for their email. If they're the only member, will need to verify identity through other means - escalate to support team for manual account lookup with additional verification."
  },
  {
    "id": "TICKET-054",
    "channel": "whatsapp",
    "customer_name": "Maria Santos",
    "customer_email": "msantos@tropicaldesigns.br",
    "customer_phone": "+55-21-99876-5432",
    "subject": "Can I use TechCorp in Portuguese?",
    "category": "feature_question",
    "priority": "low",
    "message": "Oi! Does TechCorp support Portuguese language? My team mostly speaks Portuguese and the English UI is hard for some of them",
    "expected_action": "resolve",
    "expected_response_summary": "Yes! TechCorp supports Portuguese. Go to Profile Settings > Language > select Portuguese. Each team member can set their own language preference independently. Available languages: English, Spanish, French, German, Portuguese, Japanese."
  },
  {
    "id": "TICKET-055",
    "channel": "email",
    "customer_name": "Timothy Grant",
    "customer_email": "tgrant@precisionengineering.co",
    "customer_phone": null,
    "subject": "SSO login failing with ERR-010 after IdP certificate renewal",
    "category": "bug_report",
    "priority": "urgent",
    "message": "Dear TechCorp Support,\n\nAfter our IT team renewed the SAML IdP certificate in Okta yesterday, all 85 of our team members are unable to log in via SSO. Everyone gets ERR-010: SSO Configuration Error.\n\nWe urgently need either:\n1. The SSO configuration updated with our new certificate, or\n2. A temporary bypass to allow password-based login while we sort this out\n\nThis has brought our entire engineering department to a halt. We are on the Enterprise plan and this is a P1 situation.\n\nTimothy Grant\nIT Administrator, Precision Engineering Corp",
    "expected_action": "escalate",
    "expected_response_summary": "ERR-010 after cert renewal - the new IdP certificate needs to be uploaded to TechCorp. Escalate to engineering/support for P1 handling. In the meantime, Admin can temporarily enable password-based login as fallback in Settings > Security > Authentication (if accessible). Provide steps to update SAML certificate in TechCorp."
  }
]
